# Lidando com dados "missing data" em um dataset

  

*   Missing Completely At Random (MCAR): Nesse tipo de dado faltante, a probabilidade de um dado estar faltando é a mesma para todas as observações. Ou seja, a falta de um dado não tem relação com o valor observado ou não observado de outros dados. Nesse caso, a exclusão das linhas ou colunas que possuem dados faltantes não afeta a análise dos dados restantes.

* Missing At Random (MAR):

* Missing Not At Random (MNAR):

In [14]:
# Carregando lib
import pandas as pd

# Nome do arquivo
filename = "titanic.csv"

# Leia o arquivo em um dataframe do Pandas
df = pd.read_csv(filename)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [16]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [17]:
df_clean = df.dropna(axis='rows')
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

In [18]:
df_clean = df.dropna(axis='columns')
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
dtypes: float64(1), int64(5), object(3)
memory usage: 62.8+ KB

In [19]:
novel_df = df;
novel_df['Age']=novel_df['Age'].fillna(novel_df['Age'].mean())
novel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [60]:
novel_df = df;
novel_df['Cabin'] = novel_df['Cabin'].fillna('NOCABIN')
len(novel_df[novel_df['Cabin']=='NOCABIN'])

687

In [75]:
new_df = df;
# new_df['Age'] = new_df['Age'].fillna('NOAGE')


# selected_rows = df[(df['column1'] > 10) & (df['column2'] < 5)]
len(new_df[new_df['Age']<20])
len(new_df[(new_df['Age']<20) & (new_df['Survived']==0)])
u20s = len(new_df[(new_df['Age']<20) & (new_df['Survived']==1)])*100/164
u20ns = len(new_df[(new_df['Age']<20) & (new_df['Survived']==0)])*100/164
print('U20 Not Survived:', str(len(new_df[(new_df['Age']<20) & (new_df['Survived']==0)]))
     +"\t"+str(u20ns)+"\n"+
     'U20 Survived:', str(len(new_df[(new_df['Age']<20) & (new_df['Survived']==1)]))+"\t"
     +str(u20s))

U20 Not Survived: 85	51.829268292682926
U20 Survived: 79	48.170731707317074

# Dica

Outra opção é utilizar um algoritmo de aprendizado para preencher o valor faltante! Pode-se também criar uma coluna extra para indicar a um algoritmo de aprendizagem que aquele dado é artificial.

# Exercício desafio (não obrigatório)

Considere a situação onde empresas podem solicitar serviços diversos de sua empresa após terem realizado um cadastro. Infelizmente o cadastro das empresas é feito online e sem validação e muitos dados estão incorretos.

Os dados cadastrados para cada empresa são:
 - CNPJ
 - Razão Social
 - Situação (Ativo ou não):
 - Ano de fundação

O único dado que foi validado durante o cadastro foi o formato do CPNJ. Discuta maneiras possíveis de resolver esse problema de inconsistência na base de dados (com ou sem código).

Dica: Não pense apenas nos algoritmos apresentados, durante o pré-processamento muitas vezes é necessário adaptar-se ao ambiente.